Repository: DevWael/knawat-dropshipping-woocommerce
Catalog: languages/dropshipping-woocommerce-*.po
Languages: ar

source: Cheatin&#8217; huh?
ar: هل تحاول التحايل؟

source: Knawat DropShipping
ar: قنوات دروب شيبنج

source: Knawat DropShipping (Saudi Arabia)
ar: قنوات دروب شيبنج (المملكة العربية السعودية)

source: Knawat Order Sync Interval
ar: الفاصل الزمني لمزامنة الطلبات مع قنوات

source: Order synchronize fail. order id: #%d
ar: فشل مزامنة الطلب. رقم الطلب: #% d

source: Some orders are not sycronized with knawat.com. Please
ar: بعض الطلبات ليست متزامنة مع knawat.com. رجاءً

source: synchronize it now
ar: المزامنة الآن

source: Nonce failed. Please try again.
ar: فشل nonce. الرجاء المحاولة مره أخرى.

source: Knawat status
ar: حالة قنوات

source: Latest News from Knawat
ar: آخر الأخبار من قنوات

source: %s net sales this month
ar: %s صافي مبيعات هذا الشهر

source: %s net profit this month
ar: %s صافي الربح هذا الشهر

source: %1$s top seller this month (sold %2$d)
ar: %1$s البائع الأعلى هذا الشهر (تباع% 2 $ d)

source: <strong>%s order</strong> awaiting processing
ar: <strong>%s طلب</strong> بإنتظار الإجراء

source: <strong>%s order</strong> on-hold
ar: <strong>طلب %s</strong> قيد الانتظار

source: <strong>%s product</strong> low in stock
ar: <strong>%s منتج</strong> منخفض في المخزون

source: <strong>%s product</strong> out of stock
ar: <strong>%s منتج</strong> نفذ من المخزون

source: Knawat Dropshipping
ar: قنوات دروب شيبنج

source: Dropshipping
ar: دروب شيبنج

source: Product Import
ar: استيراد المنتجات

source: Settings
ar: الإعدادات

source: Knawat Orders
ar: طلبات قنوات

source: Knawat Products
ar: منتجات قنوات

source: Rate %1$s Dropshipping Woocommerce%2$s %3$s
ar: تقييم %1$s قنوات ووكومرس دروب شيبنج %2$s %3$s

source: Manual import started successfully.
ar: بدا الإستيراد اليدوي بنجاح.

source: Something went wrong during start manual import.
ar: حدث شيء خاطئ اثناء بدء الاستيراد اليدوي.

source: Order(s) has been synchronized successfully.
ar: تمت مزامنة الطلبات بنجاح.

source: Something went wrong during order synchronization, please try again.
ar: حدث خطا اثناء مزامنة الطلبات ، الرجاء المحاولة مره أخرى.

source: Import has been stopped successfully.
ar: تم إيقاف الاستيراد بنجاح.

source: Knawat Order Status:
ar: حاله طلب قنوات:

source: Knawat Status
ar: حالة قنوات

source: Knawat Cost (%s)
ar: تكلفة قنوات (%s)

source: Dropshipper
ar: دروبشيبر

source: Select Dropshipper for this Product variantion.
ar: أختر الدروبشيبر من أجل نوع هذا المنتج

source: Stock quantity (Dropshipper)
ar: كمية المخزون (الدروبشيبر)

source: Enter a quantity of product variant for selected dropshipper.
ar: أدخل كمية نوع المنتج للدروبشيبر الذي تم اختياره

source: Before you start importing products, it's better to set default category for import Knawat Products. You can set it from <strong>Products > Categories.</strong> ex: New arrivals, or something else as you want.
ar: قبل البدء باستيراد المنتجات، يُفضّل أن تقوم بضبط الفئة الافتراضية للمنتجات التي ستقوم باستيرادها من قنوات. بإمكانك القيام بإعداد ذلك من <strong>المنتجات > الفئات</strong> مثال: وصل حديثاً، أو غير ذلك كما تريد.

source: Dismiss this notice.
ar: تجاهل هذه الملاحظة.

source: Access token not found for API. Please make sure your store is connected to knawat.com
ar: لم يتم العثور على رمز الوصول من أجل ال API. يرجى التحقق من ربط متجرك مع Knawat.com

source: Another product import is in process already.
ar: هناك عملية استيراد منتجات أخرى قيد التنفيذ بالفعل.

source: Settings has been saved successfully.
ar: تم حفظ الإعدادت بنجاح.

source: Your connection with knawat.com has been disconnected. Please check and verify your knawat consumer keys from
ar: تم قطع اتصالك مع knawat.com. يرجى التحقق من consumer keys الخاصة بمتجرك

source: <strong>Knawat Dropshipping</strong> > <strong>Settings</strong>.
ar: <strong>قنوات دروب شيبنج</strong> > <strong>الإعدادت</strong>.

source: The product will be imported again from Knawat, if you don't want this product, then delete it permanently.
ar: سيتم استيراد هذا المنتج مرة أخرى من Knawat ، إذا كنت لا تريد هذا المنتج ، قم بحذفه نهائياً من سلة المهملات.

source: Please provide product sku.
ar: يرجى التزويد برمز المنتج.

source: Something went wrong during get data from Knawat MP API. Please try again later.
ar: حدث خطأ ما أثناء الحصول على البيانات من Knawat MP API. الرجاء معاودة المحاولة في وقت لاحق.

source: Order &ndash; %s
ar: طلب &ndash; %s

# Admin: Order table column
source: Suborders
ar: الطلبات الفرعية

source: Suborders
ar: الطلبات الفرعية

source: Parent order
ar: الطلب الأب

source: Knawat Dropshipper
ar: قنوات دروبشيبر

source: Return to main order
ar: العودة إلى الطلب الرئيسي

source: Mark main order completed when all suborders are completed.
ar: قم بتغيير حالة الطلب الرئيسي إلى مكتمل عند ما تكتمل كل الطلبات الفرعية.

source: Mark main order refunded when all suborders are refunded.
ar: قم بتعيين الطلب الرئيسي إلى مستردّ عندما تكون الطلبات الفرعية مستردّة

source: %1$s stock reduced for "%2$s" from %3$s to %4$s.
ar: %1$s المخزون نقص لـ "%2$s" من %3$s إلى %4$s.

source: Something went wrong during PDF generation.
ar: لقد حدث خطأ ما أثناء إصدار ال PDF.

source: Order key not matching. better luck next time :)
ar: مفتاح الطلب غير متطابق. حظ أوفر في المرة القادمة :)

source: Woocommece PDF Invoice Plugin is not installed.
ar: لم يتم تثبيت الإضافة Woocommerce PDF Invoice .

source: Invoice for the selected order(s) could not be generated
ar: تعذر إنشاء فاتورة للطلب المحدد (الطلبات المختارة)

source: Knawat Shipment Tracking
ar: تتبع شحنة قنوات

source: Edit
ar: تعديل

source: Provider Name:
ar: اسم المزوّد:

source: Tracking number:
ar: رقم التتبع:

source: Tracking Link:
ar: رابط التتبع:

source: Track
ar: تتبَّع

source: Date shipped:
ar: تاريخ الشحن:

source: Tracking link:
ar: رابط التتبًّع:

source: Y-m-d
ar: يوم - شهر - سنة

source: Save Tracking
ar: حفظ التتبُّع

source: Knawat Order created (%s)
ar: تم إنشاء طلب قنوات (%s)

source: Knawat Order updated (%s)
ar: تم تحديث طلب قنوات (%s)

source: Knawat Order deleted (%s)
ar: تم حذف طلب قنوات (%s)

source: Knawat Order restored (%s)
ar: تم استعادة طلب قنوات (%s)

source: Knawat Setup
ar: ضبط قنوات

source: %s%s Knawat &lsaquo; Knawat Setup %s
ar: %s%s قنوات &lsaquo; ضبط قنوات %s

source: Return to the dashboard
ar: العودة إلى الإعدادات

source: Skip
ar: تخطي

source: Next
ar: التالي

source: Start
ar: ابدأ

source: Cancel
ar: إلغاء

source: Install
ar: تنصيب

source: Activate
ar: تفعيل

source: Welcome to %s
ar: مرحباً ب %s

source: Hi. Welcome back
ar: أهلاً بك مرة أخرى

source: This wizard will connect your store with Knawat and install plugins. It is optional & should take only a few minutes.
ar: سيقوم هذا المعالج بتوصيل متجرك بـ Knawat وتثبيت الإضافات. إنه اختياري ويجب أن يستغرق بضع دقائق فقط.

source: You may have already run this knawat setup wizard. If you would like to proceed anyway, click on the "Start" button below.
ar: ربما تكون قد قمت بتشغيل معالج إعداد knawat بالفعل. إذا كنت تريد المتابعة على أي حال ، فانقر فوق الزر "ابدأ" أدناه.

source: Connect Your store with Knawat
ar: ربط متجرك مع قنوات

source: You're good to go!
ar: أنت على ما يرام للإنطلاق

source: Please insert Knawat Knawat Consumer Key and Secret.
ar: الرجاء إدخال Knawat consumer key & secret.

source: Your store has already connected to Knawat.
ar: إن متجرك مرتبط مع قنوات بالفعل.

source: Learn about child themes
ar: تعلم عن الثيم الطفل.

source: Install Plugins
ar: تنصيب الإضافة.

source: You're up to speed!
ar: أنت على أحسن حال!

source: Let’s install some essential WordPress plugins to get your site up to speed.
ar: دعنا نركب بعض الإضافات الأساسية في WordPress لتسريع موقعك.

source: The required WordPress plugins are all installed and up to date. Press "Next" to continue the setup wizard.
ar: جميع الإضافات المطلوبة في WordPress مثبتة وحديثة. اضغط على "التالي" لمتابعة معالج الإعداد.

source: Advanced
ar: متقدّم

source: All done. Have fun!
ar: كله تمام. إستمتع!

source: Your store has been all set up.
ar: تم إعداد متجرك بالكامل.

source: Extras
ar: الإضافات

source: Start Adding Products
ar: بدء اضافة المنتجات.

source: <a href="https://knawat.com/" target="_blank">%s</a>
ar: <a href="https://knawat.com/ar/" target="_blank">%s</a>

source: <a href="https://help.knawat.com/hc/en-us/" target="_blank">%s</a>
ar: <a href="https://help.knawat.com/hc/ar/" target="_blank">%s</a>

source: WooCoomerce
ar: ووكومرس

source: Featured Image by URL
ar: صورة مميزة حسب الرابط

source: Knawat
ar: قنوات

source: Please define default parameters in the form of an array.
ar: يرجى تحديد المعلمات الافتراضية في شكل مصفوفة.

source: Please define an SVG icon filename.
ar: يرجى تحديد اسم رمز SVG.

source: Welcome
ar: أهلاً و سهلاً

source: Login with Knawat.com
ar: الدخول عن طريق Knawat.com

source: Plugins
ar: الإضافات

source: Ready
ar: جاهز

source: Please insert Knawat Knawat Consumer Key and Secret. You can get your Knawat keys
ar: يرجى إدخال قنوات Consumer Key و Secret. بإمكانك جلب هذه المعلومات من

source: from here
ar: هنا

source: Update
ar: تحديث

source: and
ar: و

source: * Developed by third party
ar: * طوّرت من قبل طرف ثالث

source: Activating
ar: يتم التفعيل

source: Updating
ar: يتم التحديث

source: Installing
ar: يتم التنصيب

source: Success
ar: نجح

source: Please Insert Knawat Cosumer Key.
ar: الرجاء إدخال Knawat consumer key.

source: Please Insert Knawat Cosumer Secret.
ar: الرجاء إدخال Knawat consumer secret.

source: Install Required Plugins
ar: تنصيب الإضافات المطلوبة

source: Installing Plugin: %s
ar: يتم تنصيب الإضافة %s

source: Updating Plugin: %s
ar: يتم تحديث الإضافة %s

source: Something went wrong with the plugin API.
ar: حدث خطأ مع API الإضافة.

source: Begin installing plugin
ar: يتم التنصيب

source: Begin updating plugin
ar: يتم التحديث

source: Begin activating plugin
ar: يتم التفعيل

source: Return to Required Plugins Installer
ar: ارجع الى مثبت الاضافات المطلوبة

source: Return to the Dashboard
ar: العودة إلى الإعدادات

source: Plugin activated successfully.
ar: تم تفعيل الإضافة بنجاح.

source: The following plugin was activated successfully:
ar: تم تفعيل الإضافة التالية بنجاح.

source: No action taken. Plugin %1$s was already active.
ar: لم يتم اتخاذ أي إجراء. الإضافة %1$s كانت مفعلة بالفعل.

source: Plugin not activated. A higher version of %s is needed for this theme. Please update the plugin.
ar: لم يتم تفعيل الإضافة. إصدار أعلى من %s مطلوبة من أجل هذه الثيم. يرجى تحديث الإضافة.

source: All plugins installed and activated successfully. %1$s
ar: تم تنصيب و تفعيل كل الإضافات بشكل صحيح. %1$s

source: Dismiss this notice
ar: تجاهل هذه الملاحظة

source: There are one or more required or recommended plugins to install, update or activate.
ar: هناك واحد أو أكثر من المكونات الإضافية المطلوبة أو الموصى بها لتثبيتها أو تحديثها أو تنشيطها.

source: Please contact the administrator of this site for help.
ar: يرجى الاتصال بمسؤول الموقع للحصول على المساعدة.

source: This plugin needs to be updated to be compatible with your theme.
ar: يجب تحديث هذه الإضافة ليتوافق مع ثيم الموقع.

source: Update Required
ar: تحديث مطلوب

source: Set the parent_slug config variable instead.
ar: قم بتعيين parent_slug config variable بدلاً.

source: The remote plugin package does not contain a folder with the desired slug and renaming did not work.
ar: لا تحتوي حزمة المكوِّن الإضافي عن بعد على مجلد مع البادئة المرغوبة ، ولم تعمل إعادة التسمية.

source: Please contact the plugin provider and ask them to package their plugin according to the WordPress guidelines.
ar: يرجى الاتصال بمبرمج الإضافة واطلب منهم عمل إضافتهم وفقًا لإرشادات WordPress.

source: The remote plugin package consists of more than one file, but the files are not packaged in a folder.
ar: تتكون حزمة الإضافة عن بعد من أكثر من ملف واحد ، ولكن لا يتم حزم الملفات في مجلد.

# plugin A *and* plugin B
source: and
ar: و

source: Required
ar: مطلوب

source: Recommended
ar: مستحسن

source: External Source
ar: مصدر خارجي

source: Not Installed
ar: غير مثبت

source: Installed But Not Activated
ar: منصًّب و لكن غير منشًّط

source: Active
ar: فعال

source: Required Update not Available
ar: التحديث المطلوب غير متاح

source: Requires Update
ar: تحديث مطلوب

source: Update recommended
ar: يستحسن التحديث

# plugins
source: All <span class="count">(%s)</span>
ar: كل <span class="count">(%s)</span>

source: To Install <span class="count">(%s)</span>
ar: لتنصيب <span class="count">(%s)</span>

source: Update Available <span class="count">(%s)</span>
ar: تحديث متوفر <span class="count">(%s)</span>

source: To Activate <span class="count">(%s)</span>
ar: لتفعيل <span class="count">(%s)</span>

# as in: "version nr unknown"
source: unknown
ar: غير معروف

source: Installed version:
ar: الإصدار المثبًّت:

source: Minimum required version:
ar: أقلّ إصدار مطلوب:

source: Available version:
ar: الإصدار المتوفّر:

source: No plugins to install, update or activate.
ar: لا توجد إضافات لتثبيت أو تحديث أو تنشيط.

source: Plugin
ar: الإضافة

source: Source
ar: المصدر

source: Type
ar: النوع

source: Version
ar: الإصدار

source: Status
ar: الحالة

source: Install %2$s
ar: تنصيب %2$s

source: Update %2$s
ar: تحديث %2$s

source: Activate %2$s
ar: تفعيل %2$s

source: Upgrade message from the plugin author:
ar: ترقية الرسالة من مؤلف الإضافة:

source: Every %d Minutes
ar: كل %d دقيقة

source: Please insert Knawat Consumer Key and Consumer Secret in <a href="%s">Settings</a> tab.
ar: يرجى إدخال قنوات Consumer Key و Consumer Secret في نافذة <a href="%s">الإعدادات</a>.

source: Plugin auto import/update products from knawat.com in background on regular interval. But, if you want then you can manually start import.
ar: تقوم الإضافة باستيراد/تحديث المنتجات من Knawat.com بشكل أوتوماتيكي حسب الفاصل الزمني الذي تم ضبطه. لكن، بإمكانك أيضاً بدء استيراد يدوي متى أردت.

source: Start product import
ar: ابدأ استيراد المنتجات

source: Start Import
ar: ابدأ الاستيراد

source: You're not connected to a knawat.com, please make a connection for start import.
ar: أنت لست متصل مع Knawat.com ، يرجى التحقق من الربط لبدء الاستيراد.

source: Are you sure? do you really want to stop import?
ar: هل أنت متأكد؟ هل تريد إيقاف الاستيراد الحالي بالفعل؟

source: Stop Import
ar: إيقاف الإستيراد

source: Product import is In-progress already. you can't start import now. Please find current import status below.
ar: هناك عملية استيراد منتجات قيد التقدم بالفعل. لا يمكنك البدء في الاستيراد الآن. يرجى الاطلاع على حالة الاستيراد الحالية أدناه.

source: Imported:
ar: تمت الإضافة:

source: %d Products with variations.
ar: %d منتج متعدد الأنواع مع أنواعه.

source: Updated:
ar: تم التحديث:

source: Failed:
ar: فشل:

source: Note: Only orders in Processing status will be sent to Knawat to processs.
ar: ملاحظة: سيتم إرسال الطلبات قيد المعالجة فقط إلى قنوات ليتم تنفيذها.

source: You need a Knawat consumer key and consumer secret for import products into your store from knawat.com
ar: تحتاج إلى قنوات consumer key و consumer secret من أجل استيراد المنتجات إلى متجرك من Knawat.com

source: You can get your Knawat Consumer Key
ar: تستطيع أخذ قنوات Consumer Key الخاص بك

source: You can get your Knawat Consumer Secret
ar: تستطيع أخذ قنوات Consumer Secret الخاص بك

source: Products Batch Size:
ar: حجم حقبة المنتجات:

source: Products batch size for import products from knawat.com
ar: حجم كل حقبة من المنتجات التي سيتم استيرادها من Knawat.com

source: Orders Synchronization Interval:
ar: الفاصل الزمني لمزامنة الطلبات مع قنوات

source: 48 Hours
ar: 48 ساعة

source: 24 Hours
ar: 24 ساعة

source: 12 Hours
ar: 12 ساعة

source: 9 Hours
ar: 9 ساعات

source: 6 Hours
ar: 6 ساعات

source: 3 Hours
ar: 3 ساعات

source: Select interval for synchronization orders with Knawat
ar: اختر الفاصل الزمني لمزامنة الطلبات مع قنوات

source: Dokan Seller
ar: بائع دكان

source: Select Dokan Seller
ar: اختر بائع دكان

source: Select dokan seller for import Knawat products under it.
ar: اختر بائع دكان الذي سيكون معين لمنتجات قنوات.

source: Knawat Connection status
ar: حالة الربط مع قنوات.

source: Connected
ar: مرتبط

source: Not connected
ar: غير مرتبط

source: Please verify your knawat consumer keys.
ar: يرجى التأكد من قنوات consumer key الخاص بك.

source: Save Settings
ar: حفظ الإعدادت

source: Tracking Information
ar: معلومات التتبّع

source: Provider
ar: المزود

source: Tracking Number
ar: رقم التتبع:

source: Date
ar: التاريخ

source: Knawat WooCommerce DropShipping
ar: قنوات ووكومرس دروب شيبنج

source: https://wordpress.org/plugins/dropshipping-woocommerce/
ar: https://ar.wordpress.org/plugins/dropshipping-woocommerce/

source: Knawat Team
ar: فريق قنوات
